Revit 2024 API
Frame Methods
The Frame type exposes the following members.
Methods
Name | Description
CanDefineRevitGeometry
 Tests whether the supplied Frame object may be used to define a Revit curve or surface. In order to satisfy the requirements the Frame must be orthonormal and its origin is expected to lie within the Revit design limits IsWithinLengthLimits(XYZ).
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsOrthogonal
 Determines if this frame's basis vectors are orthogonal.
IsOrthonormal
 Determines if this frame's basis vectors are orthonormal.
IsRightHanded
 Determine if this frame's basis is right-handed.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Transform
 Applies the input transform to this frame.
See Also
Frame Class
Autodesk.Revit.DB Namespace